package main

import "fmt"

func main() {
	//copy() 赋值拷贝
	//copy(要拷贝到的目的切片, 从哪里考的源切片) [)
	s0701 := []int{1, 2, 3, 4, 5}
	s0702 := []int{100, 200, 300}
	fmt.Println(s0701, s0702)

	/*copy(s0701, s0702)
	fmt.Println(s0701, s0702)*/
	// [100 200 300 4 5] [100 200 300]

	/*copy(s0701[2: 5], s0702)
	fmt.Println(s0701, s0702)*/
	//[1 2 100 200 300] [100 200 300]

	/*copy(s0701, s0702[1: 3]) // [200, 300, 3, 4, 5]
	fmt.Println(s0701, s0702)*/
	//[200 300 3 4 5] [100 200 300]

	//作业：将s2的200， 300 拷贝到s1的2和3的位置
	copy(s0701[1: 3], s0702[1: 3])
	fmt.Println(s0701, s0702)

}
