package main

import "fmt"

func main() {
	//某数学竞赛中，参赛人数大约在380-450之间。比赛结果，全体考生的总平均分为76分，男生的平均分为75，女生的平均分为80.1，求男女生各有多少人。
	for i := 380; i <= 450; i++ {
		//i是总人数，j是男生人数，女生人数是（i - j）
		for j := 1; j < 450; j++ {
			if float64(76 * i) == float64(75 * j) + 80.1 * float64(i - j) {
				fmt.Printf("总人数是%d, 男生人数是%d, 女生人数是%d\n", i, j, (i - j))
			}
		}
	}

	//有一个两位数，如果在它的前面添加一个3，可以得到一个三位数，把3添加在它的后面，也可以得到一个三位数。这两个三位数相差468，求原来的两位数。
	//300 + i
	//10 * i + 3
	//300 + i - (10 * i + 3) == 468
	//10 * i + 3 - (300 + i)
	for i := 10; i < 100; i++ {
		if 300 + i - (10 * i + 3) == 468 || 10 * i + 3 - (300 + i) == 468 {
			fmt.Println(i)
		}
	}

	//打印乘法表
	for i := 1; i <= 9; i++ {
		for j := 1; j <= i; j++ {
			fmt.Printf("%d * %d = %d\t", j, i, i * j)
		}
		fmt.Println()
	}

	for i := 0; i < 5; i++ {
		for k := 0; k < 4 - i; k++ {
			fmt.Print(" ")
		}

		for j := 0; j < 2 * i + 1; j++ {
			fmt.Print("*")
		}
		fmt.Println()
	}
}
